Repository: buldi/db-dump-explore
Catalog: locale/*/LC_MESSAGES/optimize_sql_dump.po
Languages: pl

source: Empty zip file
pl: Pusty plik zip

source: ZIP archive contains multiple files, using only the first one: {name}
pl: Archiwum ZIP zawiera wiele plików, użyty zostanie tylko pierwszy z nich: {name}

source: [INFO] Detected DB type: {db_type}
pl: [INFO] Wykryto typ bazy danych: {db_type}

source: Processing
pl: Przetwarzanie

source: [INFO] Created files for table {tname}: {sql_fname}, {tsv_fname}
pl: [INFO] Utworzono pliki dla tabeli {tname}: {sql_fname}, {tsv_fname}

source: [INFO] Created file {fname}
pl: [INFO] Utworzono plik {fname}

source: Processing table: {tname}
pl: Przetwarzanie tabeli: {tname}

source: [WARN] Failed to parse VALUES in INSERT for table {tname}: {error}
pl: [OSTRZEŻENIE] Nie udało się przetworzyć VALUES w INSERT dla tabeli {tname}: {error}

source: -- Optimized by SqlDumpOptimizer
pl: -- Zoptymalizowano przez SqlDumpOptimizer

source: -- Source: {source}
pl: -- Źródło: {source}

source: [INFO] Wrote {rows} records in {batches} batches.
pl: [INFO] Zapisano {rows} rekordów w {batches} wsadach.

source: Done. Saved to: {path}
pl: Gotowe. Zapisano do: {path}

source: Done. Split dump into files in directory: {path}
pl: Gotowe. Podzielono zrzut na pliki w katalogu: {path}

source: Done. Generated files for import in directory: {path}
pl: Gotowe. Wygenerowano pliki do importu w katalogu: {path}

source: Done. Generated insert-only files in directory: {path}
pl: Gotowe. Wygenerowano pliki tylko z danymi w katalogu: {path}

source: Analyzing dump
pl: Analizowanie zrzutu

source: --- Dump Analysis Summary ---
pl: --- Podsumowanie analizy zrzutu ---

source: Found {num_tables} tables with a total of {total_rows} rows.
pl: Znaleziono {num_tables} tabel z łączną liczbą {total_rows} wierszy.

source: Parsing dump for diff
pl: Parsowanie zrzutu w celu porównania

source: [INFO] Successfully connected to database '{db}' on {host}
pl: [INFO] Pomyślnie połączono z bazą danych '{db}' na hoście {host}

source: [ERROR] Database connection failed: {error}
pl: [BŁĄD] Połączenie z bazą danych nie powiodło się: {error}

source: [INFO] Fetched {count} primary keys for table `{tname}`.
pl: [INFO] Pobrano {count} kluczy głównych dla tabeli `{tname}`.

source: Diffing schema for {tname}
pl: Porównywanie schematu dla {tname}

source: [WARN] Skipping data diff for table `{tname}`: no primary key found.
pl: [OSTRZEŻENIE] Pomijanie porównywania danych dla tabeli `{tname}`: nie znaleziono klucza głównego.

source: Diffing data for {tname}
pl: Porównywanie danych dla {tname}

source: Generating DELETE statements
pl: Generowanie instrukcji DELETE

source: Done. Diff saved to: {path}
pl: Gotowe. Różnice zapisano do: {path}

source: --- Diff Summary ---
pl: --- Podsumowanie różnic ---

source: Tables to create: {count}
pl: Tabele do utworzenia: {count}

source: Tables to alter: {count}
pl: Tabele do zmiany: {count}

source: Rows to insert: {count}
pl: Wiersze do wstawienia: {count}

source: Rows to update: {count}
pl: Wiersze do zaktualizowania: {count}

source: Rows to delete: {count}
pl: Wiersze do usunięcia: {count}

source: Optional form: <input_file> <output_file>
pl: Opcjonalna forma: <plik_wejściowy> <plik_wyjściowy>

source: Dump file (can be .gz/.bz2/.xz/.zip)
pl: Plik zrzutu (może być .gz/.bz2/.xz/.zip)

source: Output file (optimized)
pl: Plik wyjściowy (zoptymalizowany)

source: Database dialect: mysql/postgres or auto (default)
pl: Dialekt bazy danych: mysql/postgres lub auto (domyślnie)

source: If specified, optimize only this table (name without schema)
pl: Jeśli podano, optymalizuj tylko tę tabelę (nazwa bez schematu)

source: Number of tuples in a single merged INSERT (default: 1000)
pl: Liczba krotek w pojedynczym, połączonym poleceniu INSERT (domyślnie: 1000)

source: Print diagnostic information
pl: Wyświetl informacje diagnostyczne

source: Dry run mode: does not write the output file
pl: Tryb 'na sucho': nie zapisuje pliku wyjściowego

source: Split the dump into separate files per table. If a directory is provided, files will be saved there. If no value is given, use the current directory.
pl: Dzieli zrzut na osobne pliki dla każdej tabeli. Jeśli podano katalog, pliki zostaną tam zapisane. Jeśli nie podano wartości, użyty zostanie bieżący katalog.

source: [MySQL ONLY] Generate .sql and .tsv files for LOAD DATA INFILE. Requires a directory (defaults to current). Mutually exclusive with --output and --split.
pl: [TYLKO MySQL] Generuje pliki .sql i .tsv dla LOAD DATA INFILE. Wymaga podania katalogu (domyślnie bieżący). Wzajemnie wyklucza się z --output i --split.

source: [--load-data ONLY] Number of rows buffered before writing to the .tsv file (default: 200)
pl: [TYLKO --load-data] Liczba wierszy buforowanych przed zapisem do pliku .tsv (domyślnie: 200)

source: Generate insert-only files per table, each containing TRUNCATE and INSERTs. If a directory is provided, files will be saved there. If no value is given, use the current directory. Mutually exclusive with other output modes.
pl: Generuje pliki tylko z danymi dla każdej tabeli, zawierające TRUNCATE i INSERT. Jeśli podano katalog, pliki zostaną tam zapisane. Jeśli nie podano wartości, użyty zostanie bieżący katalog. Wzajemnie wyklucza się z innymi trybami wyjścia.

source: Analyze the dump file and print a summary of its contents (tables, rows) without writing any files.
pl: Analizuje plik zrzutu i wyświetla podsumowanie jego zawartości (tabele, wiersze) bez zapisywania żadnych plików.

source: Database Diffing (Experimental)
pl: Porównywanie baz danych (eksperymentalne)

source: Generate a diff SQL file by comparing the dump against a live database.
pl: Generuje plik SQL z różnicami poprzez porównanie zrzutu z działającą bazą danych.

source: Also compare table data and generate INSERT/UPDATE/DELETE statements (requires --diff-from-db).
pl: Porównuje również dane w tabelach i generuje instrukcje INSERT/UPDATE/DELETE (wymaga --diff-from-db).

source: Database host for diffing.
pl: Host bazy danych do porównania.

source: Database user for diffing.
pl: Użytkownik bazy danych do porównania.

source: Database password for diffing.
pl: Hasło bazy danych do porównania.

source: Database name for diffing.
pl: Nazwa bazy danych do porównania.

source: You must provide an input dump (--input or the first positional argument)
pl: Musisz podać wejściowy plik zrzutu (--input lub jako pierwszy argument pozycyjny)

source: File not found: {path}
pl: Nie znaleziono pliku: {path}

source: [INFO] Output filename does not end with .sql, appending it. New name: {name}
pl: [INFO] Nazwa pliku wyjściowego nie kończy się na .sql, dodaję rozszerzenie. Nowa nazwa: {name}

source: You must specify an output mode like --output, --split, --diff-from-db, etc.
pl: Musisz określić tryb wyjścia, np. --output, --split, --diff-from-db, etc.

source: The 'mysql-connector-python' library is required for --diff-from-db. Please install it using: pip install mysql-connector-python
pl: Biblioteka 'mysql-connector-python' jest wymagana dla --diff-from-db. Zainstaluj ją za pomocą: pip install mysql-connector-python

source: --diff-from-db requires --output to be specified.
pl: Opcja --diff-from-db wymaga podania pliku wyjściowego --output.

source: --diff-from-db requires --db-user and --db-name.
pl: Opcja --diff-from-db wymaga podania --db-user oraz --db-name.

source: --diff-from-db currently only supports MySQL.
pl: Opcja --diff-from-db obecnie wspiera tylko MySQL.

source: --diff-data can only be used with --diff-from-db.
pl: Opcja --diff-data może być używana tylko z --diff-from-db.

source: SQL Dump Optimizer: merges INSERTs, detects compression, supports MySQL/Postgres.
pl: Optymalizator zrzutów SQL: łączy INSERTy, wykrywa kompresję, wspiera MySQL/Postgres.
